{
  "architectures": [
    "AIDE"
  ],
  "model_type": "aide",
  "library_name": "pytorch",
  "task": "image-classification",
  "num_labels": 2,
  "id2label": {
    "0": "real",
    "1": "fake"
  },
  "label2id": {
    "real": 0,
    "fake": 1
  },
  "image_size": 256,
  "input_tensor_shape": [
    5,
    3,
    256,
    256
  ],
  "frequency_branch": {
    "hpf_filters": 30,
    "resnet_backbones": 2,
    "resnet_variant": "ResNet-50-style encoder",
    "output_dim": 2048
  },
  "semantic_branch": {
    "backbone": "OpenCLIP ConvNeXt-XXL visual trunk",
    "pooled_dim": 3072,
    "projection_dim": 256,
    "frozen": true
  },
  "classifier": {
    "type": "mlp",
    "input_dim": 2304,
    "hidden_dim": 1024,
    "output_dim": 2
  },
  "dct_preparation": {
    "window_size": 32,
    "stride": 16,
    "output_size": 256,
    "grade_N": 6,
    "selected_views": [
      "x_minmin",
      "x_maxmax",
      "x_minmin1",
      "x_maxmax1",
      "x_0_rgb"
    ]
  },
  "checkpoint": {
    "source": "checkpoint-19.pth",
    "epoch": 19
  }
}

